app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @questions = Question.all

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_question
      @question = Question.find(params[:id])